// 24. Напишите программу, которая 
// 1. принимает на вход число (A) и 
// 2. выдаёт сумму чисел от 1 до A.

// 7 -> 28
// 4 -> 10
// 8 -> 36

Console.WriteLine("Введите целое положительное число");
int number = Convert.ToInt32(Console.ReadLine())
